[net]
batch=64
subdivisions=8
height=128
width=128
channels=1
momentum=0.9
decay=0.0005
learning_rate=0.00261
burn_in=1000
max_batches = 100000
policy=steps
steps=20000,50000,80000
scales=0.1,.1,.1
[convolutional]
filters=8
size=3
pad=1
stride=2
batch_normalize=1
activation=swish
[convolutional]
filters=8 
size=1
stride=1
pad=0
batch_normalize=1
activation=swish
[convolutional]
groups=8  
filters=8
size=3
stride=1
pad=1
batch_normalize=1
activation=swish
[avgpool]
[convolutional]
filters=4
size=1
stride=1
activation=swish
[convolutional]
filters=8
size=1
stride=1
activation=logistic
[scale_channels]
from=-4
[convolutional]
filters=4  
size=1
stride=1
pad=0
batch_normalize=1
activation=linear
[convolutional]
filters=24
size=1
stride=1
pad=0
batch_normalize=1
activation=swish
[convolutional]
groups=24  
filters=24 
size=3
pad=1
stride=2
batch_normalize=1
activation=swish
[avgpool]
[convolutional]
filters=4  
size=1
stride=1
activation=swish
[convolutional]
filters=24 
size=1
stride=1
activation=logistic
[scale_channels]
from=-4
[convolutional]
filters=6
size=1
stride=1
pad=0
batch_normalize=1
activation=linear
[convolutional]
filters=18 
size=1
stride=1
pad=0
batch_normalize=1
activation=swish
[convolutional]
groups=18   
filters=18 
size=3
stride=1
pad=1
batch_normalize=1
activation=swish
[avgpool]
[convolutional]
filters=4
size=1
stride=1
activation=swish
[convolutional]
filters=18 
size=1
stride=1
activation=logistic
[scale_channels]
from=-4
[convolutional]
filters=6 
size=1
stride=1
pad=0
batch_normalize=1
activation=linear
[dropout]
probability=.1
[shortcut]
from=-9
activation=linear
[convolutional]
filters=18 
size=1
stride=1
pad=0
batch_normalize=1
activation=swish
[convolutional]
groups=18 
filters=18
size=5
pad=1
stride=2
batch_normalize=1
activation=swish
[avgpool]
[convolutional]
filters=4 
size=1
stride=1
activation=swish
[convolutional]
filters=18 
size=1
stride=1
activation=logistic
[scale_channels]
from=-4
[convolutional]
filters=10 
size=1
stride=1
pad=0
batch_normalize=1
activation=linear
[convolutional]
filters=48 
size=1
stride=1
pad=0
batch_normalize=1
activation=swish
[convolutional]
groups=48 
filters=48
size=5
stride=1
pad=1
batch_normalize=1
activation=swish
[avgpool]
[convolutional]
filters=4
size=1
stride=1
activation=swish
[convolutional]
filters=48
size=1
stride=1
activation=logistic
[scale_channels]
from=-4
[convolutional]
filters=10
size=1
stride=1
pad=0
batch_normalize=1
activation=linear
[dropout]
probability=.1
[shortcut]
from=-9
activation=linear
[convolutional]
filters=48
size=1
stride=1
pad=0
batch_normalize=1
activation=swish
[convolutional]
groups=48 
filters=48 
size=3
stride=1
pad=1
batch_normalize=1
activation=swish
[avgpool]
[convolutional]
filters=4 
size=1
stride=1
activation=swish
[convolutional]
filters=48 
size=1
stride=1
activation=logistic
[scale_channels]
from=-4
[convolutional]
filters=20 
size=1
stride=1
pad=0
batch_normalize=1
activation=linear
[convolutional]
filters=64  
size=1
stride=1
pad=0
batch_normalize=1
activation=swish
[convolutional]
groups=64   
filters=64
size=3
stride=1
pad=1
batch_normalize=1
activation=swish
[avgpool]
[convolutional]
filters=6 
size=1
stride=1
activation=swish
[convolutional]
filters=64
size=1
stride=1
activation=logistic
[scale_channels]
from=-4
[convolutional]
filters=20
size=1
stride=1
pad=0
batch_normalize=1
activation=linear
[dropout]
probability=.1
[shortcut]
from=-9
activation=linear
[convolutional]
filters=64
size=1
stride=1
pad=0
batch_normalize=1
activation=swish
[convolutional]
groups=64  
filters=64 
size=3
stride=1
pad=1
batch_normalize=1
activation=swish
[avgpool]
[convolutional]
filters=6
size=1
stride=1
activation=swish
[convolutional]
filters=64
size=1
stride=1
activation=logistic
[scale_channels]
from=-4
[convolutional]
filters=20 
size=1
stride=1
pad=0
batch_normalize=1
activation=linear
[dropout]
probability=.1
[shortcut]
from=-9
activation=linear
[convolutional]
filters=64
size=1
stride=1
pad=0
batch_normalize=1
activation=swish
[convolutional]
groups=64  
filters=64
size=5
pad=1
stride=2
batch_normalize=1
activation=swish
[avgpool]
[convolutional]
filters=6 
size=1
stride=1
activation=swish
[convolutional]
filters=64
size=1
stride=1
activation=logistic
[scale_channels]
from=-4
[convolutional]
filters=28
size=1
stride=1
pad=0
batch_normalize=1
activation=linear
[convolutional]
filters=96
size=1
stride=1
pad=0
batch_normalize=1
activation=swish
[convolutional]
groups=96
filters=96  
size=5
stride=1
pad=1
batch_normalize=1
activation=swish
[avgpool]
[convolutional]
filters=8  
size=1
stride=1
activation=swish
[convolutional]
filters=96 
size=1
stride=1
activation=logistic
[scale_channels]
from=-4
[convolutional]
filters=28
size=1
stride=1
pad=0
batch_normalize=1
activation=linear
[dropout]
probability=.1
[shortcut]
from=-9
activation=linear
[convolutional]
filters=96  
size=1
stride=1
pad=0
batch_normalize=1
activation=swish
[convolutional]
groups=96
filters=96 
size=5
stride=1
pad=1
batch_normalize=1
activation=swish
[avgpool]
[convolutional]
filters=8  
size=1
stride=1
activation=swish
[convolutional]
filters=96
size=1
stride=1
activation=logistic
[scale_channels]
from=-4
[convolutional]
filters=28
size=1
stride=1
pad=0
batch_normalize=1
activation=linear
[dropout]
probability=.1
[shortcut]
from=-9
activation=linear
[convolutional]
filters=96
size=1
stride=1
pad=0
batch_normalize=1
activation=swish
[convolutional]
groups=96   
filters=96  
size=5
pad=1
stride=2
batch_normalize=1
activation=swish
[avgpool]
[convolutional]
filters=8  
size=1
stride=1
activation=swish
[convolutional]
filters=96  
size=1
stride=1
activation=logistic
[scale_channels]
from=-4
[convolutional]
filters=48  
size=1
stride=1
pad=0
batch_normalize=1
activation=linear
[convolutional]
filters=120  
size=1
stride=1
pad=0
batch_normalize=1
activation=swish
[convolutional]
groups=120  
filters=120   
size=5
stride=1
pad=1
batch_normalize=1
activation=swish
[avgpool]
[convolutional]
filters=16
size=1
stride=1
activation=swish
[convolutional]
filters=120
size=1
stride=1
activation=logistic
[scale_channels]
from=-4
[convolutional]
filters=48 
size=1
stride=1
pad=0
batch_normalize=1
activation=linear
[dropout]
probability=.1
[shortcut]
from=-9
activation=linear
[convolutional]
filters=120 
size=1
stride=1
pad=0
batch_normalize=1
activation=swish
[convolutional]
groups=120
filters=120 
size=5
stride=1
pad=1
batch_normalize=1
activation=swish
[avgpool]
[convolutional]
filters=16 
size=1
stride=1
activation=swish
[convolutional]
filters=120
size=1
stride=1
activation=logistic
[scale_channels]
from=-4
[convolutional]
filters=48 
size=1
stride=1
pad=0
batch_normalize=1
activation=linear
[dropout]
probability=.1
[shortcut]
from=-9
activation=linear
[convolutional]
filters=120 
size=1
stride=1
pad=0
batch_normalize=1
activation=swish
[convolutional]
groups=120   
filters=120   
size=5
stride=1
pad=1
batch_normalize=1
activation=swish
[avgpool]
[convolutional]
filters=16 
size=1
stride=1
activation=swish
[convolutional]
filters=120 
size=1
stride=1
activation=logistic
[scale_channels]
from=-4
[convolutional]
filters=48 
size=1
stride=1
pad=0
batch_normalize=1
activation=linear
[dropout]
probability=.1
[shortcut]
from=-9
activation=linear
[convolutional]
filters=120 
size=1
stride=1
pad=0
batch_normalize=1
activation=swish
[convolutional]
groups=120    
filters=120 
size=3
stride=1
pad=1
batch_normalize=1
activation=swish
[avgpool]
[convolutional]
filters=16
size=1
stride=1
activation=swish
[convolutional]
filters=120
size=1
stride=1
activation=logistic
[scale_channels]
from=-4
[convolutional]
filters=54 
size=1
stride=1
pad=0
batch_normalize=1
activation=linear
[convolutional]
filters=128 
size=1
stride=1
pad=0
batch_normalize=1
activation=swish
[avgpool]
[dropout]
probability=.1
[convolutional]
filters=2
size=1
stride=1
pad=0
activation=linear
[softmax]
groups=1
